Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: This directory contains architecture-specific work sub-directories for packages built by BitBake. All tasks execute from the appropriate work directory. For example, the source for a particular package is unpacked, patched, configured and compiled all within its own work directory. Within the work directory, organization is based on the package group and version for which the source is being compiled as defined by the :term:`WORKDIR`.
it_it: Questa directory contiene sottodirectory di lavoro specifiche per l'architettura dei pacchetti compilati da BitBake. Tutte le operazioni vengono eseguite dalla directory di lavoro appropriata. Ad esempio, il codice sorgente di un determinato pacchetto viene decompresso, patchato, configurato e compilato all'interno della sua directory di lavoro. All'interno della directory di lavoro, l'organizzazione si basa sul gruppo di pacchetti e sulla versione per cui il codice sorgente viene compilato, come definito da :term:`WORKDIR`.

source: This directory contains codecs and support utilities for audio, images and video.
it_it: Questa directory contiene codec e utility di supporto per audio, immagini e video.

source: This directory contains common license files and several text files used by the build system, as well as :ref:`Wic files <dev-manual/wic:creating partitioned images using wic>` that define the layouts of the images produced by the build. The text files contain minimal device information and lists of files and directories with known permissions.
it_it: Questa directory contiene i file di licenza comuni e diversi file di testo utilizzati dal sistema di compilazione, nonché i file :ref:`Wic files <dev-manual/wic:creating partitioned images using wic>` che definiscono il layout delle immagini prodotte dalla compilazione. I file di testo contengono informazioni minime sul dispositivo ed elenchi di file e directory con permessi noti.

source: This directory contains downloaded upstream source tarballs. You can reuse the directory for multiple builds or move the directory to another location. You can control the location of this directory through the :term:`DL_DIR` variable.
it_it: Questa directory contiene i tarball del codice sorgente scaricati dal progetto upstream. È possibile riutilizzare la directory per più build o spostarla in un'altra posizione. È possibile controllare la posizione di questa directory tramite la variabile :term:`DL_DIR`.

source: This directory contains general logs that are not otherwise placed using the package's :term:`WORKDIR`. Examples of logs are the output from the ``do_check_pkg`` or ``do_distro_check`` tasks. Running a build does not necessarily mean this directory is created.
it_it: Questa directory contiene i log generali che non vengono altrimenti inseriti utilizzando la directory :term:`WORKDIR` del pacchetto. Esempi di log sono l'output dei task ``do_check_pkg`` o ``do_distro_check``. L'esecuzione di una build non implica necessariamente la creazione di questa directory.

source: This directory contains libraries and applications related to communication with other devices.
it_it: Questa directory contiene librerie e applicazioni relative alla comunicazione con altri dispositivi.

source: This directory contains non-essential applications that add features compared to the alternatives in core. You might need this directory for full tool functionality.
it_it: Questa directory contiene applicazioni non essenziali che aggiungono funzionalità rispetto alle alternative presenti nel core. Potrebbe essere necessaria per sfruttare appieno tutte le funzionalità dei tool.

source: This directory contains package and image recipes for using and testing the ``PREEMPT_RT`` kernel.
it_it: Questa directory contiene le ricette di pacchetti e immagini per l'utilizzo e il test del kernel ``PREEMPT_RT``.

source: This directory contains recipes used by other recipes, but that are not directly included in images (i.e. dependencies of other recipes).
it_it: Questa directory contiene le ricette utilizzate da altre ricette, ma non incluse direttamente nelle immagini (ovvero, dipendenze di altre ricette).

source: This directory contains several internal files used by the OpenEmbedded build system. The path to this directory is defined by the :term:`PERSISTENT_DIR` variable.
it_it: Questa directory contiene diversi file interni utilizzati dal sistema di build OpenEmbedded. Il path di questa directory è definito dalla variabile :term:`PERSISTENT_DIR`.

source: This directory contains template recipes for BSP and kernel development.
it_it: Questa directory contiene ricette template per lo sviluppo di BSP e kernel.

source: This directory contains the Sato demo/reference UI/UX and its associated applications and configuration data.
it_it: Questa directory contiene il demo/reference UI/UX di Sato e le relative applicazioni e dati di configurazione.

source: This directory contains the Yocto Project reference hardware Board Support Packages (BSPs). For more information on BSPs, see the :doc:`/bsp-manual/index`.
it_it: Questa directory contiene i Board Support Package (BSP) di riferimento per l'hardware di Yocto Project. Per ulteriori informazioni sui BSP, consultare il manuale :doc:`/bsp-manual/index`.

source: This directory contains the core set of configuration files that start from ``bitbake.conf`` and from which all other configuration files are included. See the include statements at the end of the ``bitbake.conf`` file and you will note that even :ref:`structure-build-conf-local.conf` is loaded from there. While ``bitbake.conf`` sets up the defaults, you can often override these by using the (:ref:`structure-build-conf-local.conf`) file, machine file or the distribution configuration file.
it_it: Questa directory contiene il set principale di file di configurazione che partono da ``bitbake.conf`` e da cui vengono inclusi tutti gli altri file di configurazione. Osservando le istruzioni di inclusione alla fine del file ``bitbake.conf``, si noterà che anche :ref:`structure-build-conf-local.conf` viene caricato da lì. Sebbene ``bitbake.conf`` imposti i valori di default, è spesso possibile sovrascriverli utilizzando il file (:ref:`structure-build-conf-local.conf`), il file di configurazione della macchina o il file di configurazione della distribuzione.

source: This directory contains the kernel and generic applications and libraries that have strong kernel dependencies.
it_it: Questa directory contiene il kernel e le applicazioni e librerie generiche che hanno forti dipendenze dal kernel.

source: This directory contains the minimal, underlying :term:`OpenEmbedded-Core (OE-Core)` metadata. The directory holds recipes, common classes, and machine configuration for strictly emulated targets (``qemux86``, ``qemuarm``, and so forth.)
it_it: Questa directory contiene i metadati minimi di base di :term:`OpenEmbedded-Core (OE-Core)`. La directory contiene ricette, classi comuni e configurazione della macchina per target strettamente emulati (``qemux86``, ``qemuarm``, e così via).

source: This directory contains the shared state cache. You can reuse the directory for multiple builds or move the directory to another location. You can control the location of this directory through the :term:`SSTATE_DIR` variable.
it_it: Questa directory contiene la cache di shared state [stato condivisa]. È possibile riutilizzare la directory per più build o spostarla in un'altra posizione. È possibile controllare la posizione di questa directory tramite la variabile :term:`SSTATE_DIR`.

source: This directory contains tools that are primarily used by the build system. The tools, however, can also be used on targets.
it_it: Questa directory contiene tool utilizzati principalmente dal sistema di build. Tuttavia, questi strumenti possono essere utilizzati anche sui dispositivi target.

source: This directory contains user configuration files and the output generated by the OpenEmbedded build system in its standard configuration where the source tree is combined with the output. The :term:`Build Directory` is created initially when you ``source`` the OpenEmbedded build environment setup script (i.e. :ref:`structure-core-script`).
it_it: Questa directory contiene i file di configurazione utente e l'output generato dal sistema di build OpenEmbedded nella sua configurazione standard, in cui l'albero dei sorgenti è combinato con l'output. La :term:`Build Directory` viene creata inizialmente quando si esegue ``source`` lo script di configurazione dell'ambiente di build di OpenEmbedded (ovvero :ref:`structure-core-script`).

source: This directory contains various integration scripts that implement extra functionality in the Yocto Project environment (e.g. QEMU scripts). The :ref:`structure-core-script` script prepends this directory to the shell's ``PATH`` environment variable.
it_it: Questa directory contiene vari script di integrazione che implementano funzionalità aggiuntive nell'ambiente di Yocto Project (ad esempio, script QEMU). Lo script :ref:`structure-core-script` aggiunge questa directory all'inizio della variabile d'ambiente ``PATH`` della shell.

source: This directory contains what is needed to build a basic working Linux image including commonly used dependencies.
it_it: Questa directory contiene tutto il necessario per creare un'immagine Linux di base funzionante, incluse le dipendenze più comuni.

source: This directory contains:
it_it: Questa directory contiene:

source: This directory holds information that BitBake uses for accounting purposes to track what tasks have run and when they have run. The directory is sub-divided by architecture, package name, and version. Here is an example::
it_it: Questa directory contiene informazioni che BitBake utilizza a fini contabili per tenere traccia dei task eseguiti e del momento in cui sono stati eseguiti. La directory è suddivisa per architettura, nome del pacchetto e versione. Ecco un esempio::

source: This directory holds the source for the Yocto Project documentation as well as templates and tools that allow you to generate PDF and HTML versions of the manuals. Each manual is contained in its own sub-folder; for example, the files for this reference manual reside in the ``ref-manual/`` directory.
it_it: Questa directory contiene il codice sorgente della documentazione di Yocto Project, nonché template e tool che consentono di generare versioni PDF e HTML dei manuali. Ogni manuale è contenuto in una propria sottocartella; ad esempio, i file per questo manuale di riferimento si trovano nella directory ``ref-manual/``.

source: This directory includes a copy of BitBake for ease of use. The copy usually matches the current stable BitBake release from the BitBake project. BitBake, a :term:`Metadata` interpreter, reads the Yocto Project Metadata and runs the tasks defined by that data. Failures are usually caused by errors in your Metadata and not from BitBake itself.
it_it: Questa directory include una copia di BitBake per facilità d'uso. La copia corrisponde solitamente alla versione stabile corrente di BitBake rilasciata dal progetto BitBake. BitBake, un interprete di :term:`Metadata`, legge i Metadati di Yocto Project ed esegue i task [attività] definiti da tali dati. Gli errori sono generalmente causati da problemi nei Metadati e non da BitBake stesso.

source: This directory is not mandatory for building with :term:`BitBake`.
it_it: Questa directory non è obbligatoria per la compilazione con :term:`BitBake`.

source: This directory is populated with the basic output objects of the build (think of them as the "generated artifacts" of the build process), including things like the boot loader image, kernel, root filesystem and more. If you want to flash the resulting image from a build onto a device, look here for the necessary components.
it_it: Questa directory contiene gli oggetti di output di base della build (considerali come gli "artefatti generati" dal processo di build), tra cui l'immagine del boot loader, il kernel, il filesystem root e altro ancora. Per caricare l'immagine risultante da una build su un dispositivo, consultare questa directory per trovare i componenti necessari.

source: This directory is the location of the sysroot contents that the task :ref:`ref-tasks-prepare_recipe_sysroot` links or copies into the recipe-specific sysroot for each recipe listed in :term:`DEPENDS`. Population of this directory is handled through shared state, while the path is specified by the :term:`COMPONENTS_DIR` variable. Apart from a few unusual circumstances, handling of the ``sysroots-components`` directory should be automatic, and recipes should not directly reference ``build/tmp/sysroots-components``.
it_it: Questa directory contiene il contenuto del sysroot che il task :ref:`ref-tasks-prepare_recipe_sysroot` collega o copia nel sysroot specifico della ricetta per ciascuna ricetta elencata in :term:`DEPENDS`. Il popolamento di questa directory viene gestito tramite lo "shared state" [stato condiviso], mentre il path è specificato dalla variabile :term:`COMPONENTS_DIR`. A parte alcune circostanze eccezionali, la gestione della directory ``sysroots-components`` dovrebbe essere automatica e le ricette non dovrebbero fare riferimento direttamente a ``build/tmp/sysroots-components``.

source: This directory receives ``.ipk`` packages produced by the build process.
it_it: Questa directory contiene i pacchetti ``.ipk`` prodotti dal processo di compilazione.

source: This directory receives any ``.deb`` packages produced by the build process. The packages are sorted into feeds for different architecture types.
it_it: Questa directory contiene tutti i pacchetti ``.deb`` prodotti dal processo di compilazione. I pacchetti sono suddivisi in feed per diversi tipi di architettura.

source: This directory receives any ``.rpm`` packages produced by the build process. The packages are sorted into feeds for different architecture types.
it_it: Questa directory contiene tutti i pacchetti ``.rpm`` prodotti dal processo di compilazione. I pacchetti sono suddivisi in feed per diversi tipi di architettura.

source: This directory receives package licensing information. For example, the directory contains sub-directories for ``bash``, ``busybox``, and ``glibc`` (among others) that in turn contain appropriate ``COPYING`` license files with other licensing information. For information on licensing, see the ":ref:`dev-manual/licenses:maintaining open source license compliance during your product's lifecycle`" section in the Yocto Project Development Tasks Manual.
it_it: Questa directory contiene le informazioni di licenza dei pacchetti. Ad esempio, la directory contiene sottocartelle per ``bash``, ``busybox`` e ``glibc`` (tra gli altri) che a loro volta contengono i relativi file di licenza ``COPYING`` con altre informazioni di licenza. Per informazioni sulle licenze, consultare la sezione ":ref:`dev-manual/licenses:maintaining open source license compliance during your product's lifecycle`" nel Manuale di Sviluppo dei Task di Yocto Project.

source: This directory should not be shared between builds.
it_it: Questa directory non deve essere condivisa tra diverse compilazioni. [build].

source: This directory stores the build statistics as generated by the :ref:`ref-classes-buildstats` class.
it_it: Questa directory memorizza le statistiche di compilazione generate dalla classe :ref:`ref-classes-buildstats`.

source: This document goes through the steps to enable shared state signing. This feature is fully dependent on :wikipedia:`GPG <GNU_Privacy_Guard>`, meaning examples shown in this document will use the ``gpg`` command-line tool.
it_it: Questo documento illustra i passaggi per abilitare la firma dello shared state. Questa funzionalità dipende completamente da :wikipedia:`GPG <GNU_Privacy_Guard>`, il che significa che gli esempi mostrati in questo documento utilizzeranno il tool da riga di comando ``gpg``.

source: This documentation was built for the Blacksail release.
it_it: Questa documentazione è stata creata per la versione Blacksail.

source: This enables long-lived tracing sessions to run without writing anything to disk, and allows the user to look for certain conditions in the trace data in 'real-time' by viewing the trace output as it scrolls by on the screen or by passing it along to yet another program in the pipeline such as grep which can be used to identify and capture conditions of interest.
it_it: Questo permette di eseguire sessioni di tracciamento di lunga durata senza scrivere nulla su disco e consente all'utente di cercare determinate condizioni nei dati di tracciamento in 'real-time', visualizzando l'output di tracciamento che scorre sullo schermo o passandolo a un altro programma nella pipeline, come grep, che può essere utilizzato per identificare e acquisire le condizioni di interesse.

source: This ensures that rerunning the task always produces the same end result and the original file can be preserved to reuse. It also guards against an interrupted build corrupting the file.
it_it: Questo garantisce che la riesecuzione del task produca sempre lo stesso risultato finale e che il file originale possa essere conservato per essere riutilizzato. Protegge inoltre dal rischio che un'interruzione della compilazione possa corrompere il file.

source: This example binds to a specific IP address on the host's NIC::
it_it: Questo esempio si collega a uno specifico indirizzo IP sulla scheda di rete dell'host::

source: This example ensures that the :term:`PACKAGE_ARCHS` variable does not depend on the value of :term:`MACHINE`, even if it does reference it.
it_it: Questo esempio garantisce che la variabile :term:`PACKAGE_ARCHS` non dipenda dal valore di :term:`MACHINE`, anche se lo referenzia.

source: This example explicitly adds the :term:`MACHINE` variable as a dependency for :term:`PACKAGE_ARCHS`.
it_it: Questo esempio aggiunge esplicitamente la variabile :term:`MACHINE` come dipendenza per :term:`PACKAGE_ARCHS`.

source: This file can be shared for multiple build directories. For example, :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>` makes the :ref:`structure-build-conf-site.conf` file a symbolic link to a common :ref:`structure-build-conf-auto.conf` file::
it_it: Questo file può essere condiviso per più directory di build. Ad esempio, :doc:`bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>` crea un link simbolico al file :ref:`structure-build-conf-site.conf`, che punta a un file comune :ref:`structure-build-conf-auto.conf`::

source: This file contains configuration variables that are automatically modified by tools such as :oe_git:`bitbake-config-build </bitbake/tree/bin/bitbake-config-build>`. This file should not be modified manually.
it_it: Questo file contiene variabili di configurazione che vengono modificate automaticamente da strumenti come :oe_git:`bitbake-config-build </bitbake/tree/bin/bitbake-config-build>`. Questo file non deve essere modificato manualmente.

source: This file is a description of the contents of ``recipes-*``.
it_it: Questo file descrive il contenuto di ``recipes-*``.

source: This file is intended for use by continuous integration environments, such as the Yocto Project's :doc:`Autobuilder </test-manual/understand-autobuilder>`. It should not be created or modified when running local builds.
it_it: Questo file è destinato all'uso in ambienti di "continuous integration", come l':doc:`Autobuilder </test-manual/understand-autobuilder>` di Yocto Project. Non deve essere creato o modificato durante l'esecuzione di build locali.

source: This file provides information on how to boot the live images that are optionally included in the ``binary/`` directory. The ``README`` file also provides information needed for building the image.
it_it: Questo file fornisce informazioni su come avviare le immagini live che sono facoltativamente incluse nella directory ``binary/``. Il file ``README`` fornisce anche le informazioni necessarie per la creazione dell'immagine.

source: This file provides information on where to locate the BSP source files used to build the images (if any) that reside in ``meta-bsp_root_name/binary``. Images in the ``binary`` would be images released with the BSP. The information in the ``README.sources`` file also helps you find the :term:`Metadata` used to generate the images that ship with the BSP.
it_it: Questo file fornisce informazioni su dove trovare i file sorgente del BSP utilizzati per creare le immagini (se presenti) che si trovano nella directory ``meta-bsp_root_name/binary``. Le immagini nella directory ``binary`` sono quelle rilasciate con il BSP. Le informazioni contenute nel file ``README.sources`` aiutano anche a trovare i :term:`Metadata` utilizzati per generare le immagini fornite con il BSP.

source: This file simply makes :term:`BitBake` aware of the recipes and configuration directories. The file must exist so that the OpenEmbedded build system can recognize the BSP.
it_it: Questo file si limita a far conoscere a :term:`BitBake` le directory delle ricette e della configurazione. Il file deve esistere affinché il sistema di build OpenEmbedded possa riconoscere il BSP.

source: This gives us a detailed timestamped sequence of events that occurred within the workload with respect to those events.
it_it: Questo ci fornisce una sequenza dettagliata e con timestamp degli eventi che si sono verificati all'interno del carico di lavoro in relazione a tali eventi.

source: This guide presents information about BSP layers, defines a structure for components so that BSPs follow a commonly understood layout, discusses how to customize a recipe for a BSP, addresses BSP licensing, and provides information that shows you how to create a BSP Layer using the :ref:`bitbake-layers <bsp-manual/bsp:Creating a new BSP Layer Using the \`\`bitbake-layers\`\` Script>` tool.
it_it: Questa guida presenta informazioni sui layer BSP, definisce una struttura per i componenti in modo che i BSP seguano un layout comunemente compreso, illustra come personalizzare una ricetta per un BSP, affronta le licenze BSP e fornisce informazioni su come creare un layer BSP utilizzando il tool :ref:`bitbake-layers <bsp-manual/bsp:Creating a new BSP Layer Using the \`\`bitbake-layers\`\` Script>`.

source: This is a public mailing list for anyone to subscribe to. This list is an open list to discuss public security issues/patches and security-related initiatives. For more information, including subscription information, please see the :yocto_lists:`yocto-security mailing list info page </g/yocto-security>`.
it_it: Questa è una mailing list pubblica a cui chiunque può iscriversi. Questa lista è aperta per discutere di problemi/patch di sicurezza pubblici e iniziative relative alla sicurezza. Per ulteriori informazioni, incluse quelle relative all'iscrizione, consultare la pagina informativa della mailing list :yocto_lists:`yocto-security mailing list info page </g/yocto-security>`.

source: This is a replacement for the legacy init RAM disk ("initrd") technique, booting on an emulated block device in RAM, but being less efficient because of the overhead of going through a filesystem and having to duplicate accessed file contents in the file cache in RAM, as for any block device.
it_it: Questa tecnica sostituisce il vecchio disco RAM di inizializzazione ("initrd"), che si avviava su un dispositivo a blocchi emulato nella RAM, ma risultava meno efficiente a causa dell'overhead dovuto al passaggio attraverso un filesystem e alla necessità di duplicare il contenuto dei file a cui si accede nella cache dei file nella RAM, come avviene per qualsiasi dispositivo a blocchi.
